# персистентность - данные сохранились в дата бейз и после загрузки они сохранили свои данные (срок жизни у программы остается)
# пока кондиционер подключен к электричеству - он выполняет свою функц,  мы выключаем - перестает работать, но когда включаем последние задача остается
# они сохраняются в дата бейз, в флешках и т.п.

# любые данные передаются через

with open("test.txt","w",encoding="utf-8") as file:
    file.write("Hello Kristina!")
    file.write("Alex")

"""
open() — функция Python для открытия файла.
"test.txt" — имя файла.
Если файла test.txt нет, Python при режиме "w" создаст его.
"w" означает write — запись. То есть мы хотим записать информацию в файл.
если файл уже существует, его старое содержимое будет удалено и заменено новым.
encoding="utf-8" Указывает, в какой кодировке работать с текстом.
UTF-8 позволяет нормально работать, например, с:
Hello!
Привет!
שלום!
Для обычных текстовых файлов это хороший стандартный вариант.
as file Мы даём открытому файлу имя file.
file.write("Hello!") write() — метод, который записывает текст в файл.

Итог: Можно прочитать так:
Открой файл test.txt для записи в кодировке UTF-8, назови открытый файл file, запиши туда Hello!, а после этого автоматически закрой файл.
"""
file = open("test.txt","w",encoding="utf-8")
file.write("Hello Kris")
file.close()
# то же самое, но чуть длине запись

# with == try/catch/finally (from java)
# заменяет собой try ... finally, то есть закрытие произойдет даже в случае исключения

# "r" - read - то же самое, что и "w" но он перезаписывает в существующий файл
# "w" - write - создает и перезаписывает
# "a" - append - добавляет в конец не стирая содержимое файла
# "rb" - "wd" pdf, screenshot создает и перезаписывает в формате pdf и создает screenshot

def log_res(test_name,status):
    with open("test1.txt","a",encoding="utf-8") as file:
        file.write(f"{test_name}:{status}\n")
log_res("test_register","PASSED")
log_res("test_login", "FAILED")
log_res("test_logout", "FAILED")
# это история наших тестов к примеру, они каждый раз ниже перезаписываются

