import unittest


# Здесь мы изучаем как тестировать функцию, которая вызывает ошибку (raise ValueError), с помощью unittest
def check_password(password):   # password — параметр, в который передаётся пароль
    if len(password) < 8:
        raise ValueError("Password is too short")
# raise — вызывает ошибку и останавливает обычное выполнение функции
# Если пароль слишком короткий, функция сообщает: пароль слишком короткий
    return True  # возвращает результат из функции, только если пароль содержит не менее 8 символов

class TestCheckPasswordLength(unittest.TestCase):   # функция проверяет длину пароля
    def test_short_password(self):
        # Цель  — убедиться, что функция вызывает ошибку ValueError, если пароль слишком короткий
        with self.assertRaises(ValueError):
        # Это специальная конструкция unittest, которая проверяет, возникнет ли ожидаемая ошибка
            check_password(password="234")
    # with — начинает специальный блок проверки.
    # self.assertRaises(ValueError) — указывает, какую ошибку мы ожидаем.
    # check_password(password="234") — запускает функцию с паролем из трёх символов.
    # Функция проверяет len("234") < 8.
    # Условие истинно, поэтому срабатывает raise ValueError(...).
    # assertRaises перехватывает ожидаемую ошибку, и !тест проходит успешно!.
# Важный момент: если функция не вызовет ошибку, тест провалится.
# И если возникнет ошибка другого типа, например TypeError, тест тоже провалится.

    def test_long_password(self):
        self.assertTrue(check_password(password="ase123"))
# self.assertTrue - Этот метод проверяет, является ли результат выражения истинным (True)
    # 1. len("ase123") возвращает 6.
    # 2. Условие 6 < 8 истинно.
    # 3. Выполняется raise ValueError("Password is too short").
    # 4. Функция не возвращает True.
    # 5. Ошибка возникает внутри assertTrue(), но тест её не ожидает.
    # Результат: FAIL — тест провалится.
    # Как исправить?
    # Используй пароль длиной не менее 8 символов!

# Главное различие между assertRaises() и assertTrue()
#       Метод	                Что проверяет	        Когда тест проходит
# assertRaises(ValueError)	Возникновение ошибки	Если возникает ожидаемая ошибка
# assertTrue(result)	    Истинность результата	Если результат равен True
# В QA это два разных типа проверок:
# - Негативный тест — передаём неправильные данные и проверяем, что программа правильно обрабатывает ошибку.
# Например, пароль "234".
# - Позитивный тест — передаём допустимые данные и проверяем, что программа работает правильно.
# Например, пароль "ase12345".
# Запомни простую логику: в первом тесте мы ожидаем ошибку, а во втором — успешный результат True.