numbers = [1,2,3,4,5,6]

squ = map(lambda x:x**2,numbers)
print(squ)
print(list(squ))

# это функция, которая применяет одну и ту же операцию к каждому элементу списка или другого итерируемого объекта
# То есть map — это способ обработать каждый элемент списка одинаковым действием.
# Общая форма: map(функция, список)
# map не возвращает список, он показывает объект, создает итератор который хранит информацию
# map применяет эту функцию ко всем элементам нумберс - мап возвращает итератор

def to_upper(s):
    return s.upper()
status =["passed","failed","skip"]
upper_status = list(map(to_upper,status))
print(upper_status)