import re

print(re.search(r"@","test@gmail.com"))
print(re.search(r"[\w.]","test@gmail.com"))  # найти одну букву, цифру, подчёркивание или точку
print(re.search(r"\w.+@","test@gmail.com"))
# \w ищет одну букву, цифру, подчёркивание, . ищет любой символ, кроме перевода строки,
# + Один или более предыдущих элементов, Затем символ @
# Почему test@?
# - t подходит под \w.
# - est подходят под .+.
# - @ соответствует последнему символу шаблона.
print(re.search(r"[\w.]+@[\w]+","test@gmail.com"))
# [\w.]+	Один или более символов: буквы, цифры, _ или точка
# @	Символ @
# [\w]+	Одна или более букв, цифр или _
# Почему совпадение заканчивается на gmail, а не на com?
# Шаблон после @ содержит [\w]+. Он может совпадать с буквами gmail, но точка после gmail не подходит под \w.
# Поэтому поиск останавливается перед точкой.